sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
      if(d.state !== 'IDLE') {
        if (!isRunning) {
          isRunning = true;
          document.body.classList.add('running');
          sessionStartTime = Date.now() - (d.elap || 0);
        }

        let txt = "動作中";
        if(d.state === 'PREPARE_SQUEEZE') txt = "準備中...";
        if(d.state === 'SQUEEZING') txt = "握り中";
        if(d.state === 'HOLDING') txt = "保持中";
        if(d.state === 'RELEASING') txt = "解放中";
        document.getElementById('status-badge').innerText = `${txt} (${d.cycle+1}/${d.total})`;

        sessionTotalDur = d.dur || 1; 
        const estimatedStart = Date.now() - (d.elap || 0);
        if (Math.abs(estimatedStart - sessionStartTime) > 500) {
           sessionStartTime = estimatedStart;
        }

      } else {
        // IDLEに戻った = 動作完了
        if (isRunning && !isStarting) {
          finishSession();
        }
      }
      lastStatus = d.state;
    })
    .catch(e => {
      setOnline(false);
    });
}
setInterval(syncStatus, 1000);

function finishSession() {
  if (!isRunning) return; // 既に完了済みなら何もしない
  isRunning = false;
  document.body.classList.remove('running');
  document.getElementById('status-badge').innerText = "待機中";
  document.getElementById('yt-fill').style.width = '0%';
  updTimeDisp(); 
  
  if (!isManualStop) {
    showCompletionModal();
  }
  isManualStop = false;
}

function showCompletionModal() {
  const modal = document.getElementById('completion-modal');
  document.getElementById('detail-preset').innerText = runPreset;
  document.getElementById('detail-strength').innerText = runStrength + '%';
  document.getElementById('detail-count').innerText = runCount + '回';
  modal.classList.add('show');
}

function closeCompletionModal() {
  document.getElementById('completion-modal').classList.remove('show');
}

function setAllServos(angle) {
  document.getElementById('all-servo-val').innerText = angle + '°';
  document.getElementById('servo1-val').innerText = angle + '°';
  document.getElementById('servo2-val').innerText = angle + '°';
  document.getElementById('servo3-val').innerText = angle + '°';
  fetch(`/api/servo_all?angle=${angle}`);
}

function setServo(servoNum, angle) {
  document.getElementById(`servo${servoNum}-val`).innerText = angle + '°';
  fetch(`/api/servo_individual?servo=${servoNum}&angle=${angle}`);
}

// 個別サーボ位置補正
function updateServoOffset(servoNum, value) {
  document.getElementById(`servo${servoNum}-offset-disp`).innerText = value;
  fetch(`/api/servo_offset?servo=${servoNum}&value=${value}`)
    .then(r => r.text())
    .then(d => console.log(`Servo ${servoNum} offset:`, value));
}

// 初期化時に個別サーボオフセット読み込み
function fetchServoOffsets() {
  for (let i = 1; i <= 3; i++) {
    fetch(`/api/servo_offset?servo=${i}`)
      .then(r => r.json())
      .then(data => {
        const offset = data.offset || 0;
        document.getElementById(`inp-servo${i}-offset`).value = offset;
        document.getElementById(`servo${i}-offset-disp`).innerText = offset;
      })
      .catch(e => console.error(`Failed to fetch servo ${i} offset:`, e));
  }
}

// センサー距離更新（1秒ごと）
setInterval(() => {
  fetch('/api/distance')
    .then(r => r.json())
    .then(data => {
      document.getElementById('distance-disp').innerText = data.distance.toFixed(1);
    })
    .catch(e => console.error('Distance fetch error:', e));
}, 1000);

// 起動時に個別オフセット読み込み
fetchServoOffsets();
fetchServoLimits();

// 角度制限更新
function updateServoLimit(servoNum) {
  const minVal = document.getElementById(`min-angle-${servoNum}`).value;
  const maxVal = document.getElementById(`max-angle-${servoNum}`).value;
  
  if(parseInt(minVal) > parseInt(maxVal)) {
    // 最小値が最大値を超えないように
    return;
  }

  fetch(`/api/servo_limit?servo=${servoNum}&min=${minVal}&max=${maxVal}`)
    .then(r => r.text())
    .then(d => console.log(`Servo ${servoNum} limit updated: ${minVal}-${maxVal}`));
}

// 角度制限読み込み
function fetchServoLimits() {
  for(let i=1; i<=3; i++) {
    fetch(`/api/servo_limit?servo=${i}`)
      .then(r => r.json())
      .then(d => {
        document.getElementById(`min-angle-${i}`).value = d.min;
        document.getElementById(`max-angle-${i}`).value = d.max;
      });
  }
}


</script>
</body>
</html>
)rawliteral";

WebServer server(80);
DNSServer dnsServer;
const byte DNS_PORT = 53;
Preferences preferences;

Servo servo1, servo2, servo3;
const int PIN_SERVO1 = 25;
const int PIN_SERVO2 = 26;
const int PIN_SERVO3 = 27;

// --- サーボ設定 ---
const int US_AT_0_DEG = 500;    // 0度 (閉/強)
const int US_AT_270_DEG = 2500; // 270度 (開/弱)
const unsigned long DETACH_DELAY_MS = 5000;

// --- 位置補正（個別サーボオフセット） ---
int servo1Offset = 0; // -90 ~ +90の範囲で調整可能
int servo2Offset = 0;
int servo3Offset = 0;

// --- 角度制限 (最小/最大) ---
int minAngle1 = 0;
int maxAngle1 = 270;
int minAngle2 = 0;
int maxAngle2 = 270;
int minAngle3 = 0;
int maxAngle3 = 270;

// --- HC-SR04センサー ---
const int TRIG_PIN = 32;
const int ECHO_PIN = 33;
float currentDistance = 0.0;
unsigned long lastDistanceMeasure = 0;

// 前方宣言
void setServoAngleSafe(int servoNum, int targetAngle);

bool sensorEnabled = false;

// --- 履歴構造体 ---
struct HistoryItem {
  String timeStr;
  String preset;
  int strength;
  int count;
};
std::vector<HistoryItem> historyLog;
String currentSessionPreset = "Custom";

// 状態管理
enum State { IDLE, PREPARE_SQUEEZE, SQUEEZING, HOLDING, RELEASING, WAIT_CYCLE };
State currentState = IDLE;
State lastState = IDLE;

unsigned long stateStartTime = 0;
unsigned long sessionStartTime = 0;

// パラメータ
float holdTimeSec = 0.5;
float reachTimeSec = 0.5;
int targetStrength = 50;
int targetCount = 3;
int currentCycle = 0;
int pin13State = 0;

void setAllServosAngle(int angle) {
  setServoAngleSafe(1, angle);
  setServoAngleSafe(2, angle);
  setServoAngleSafe(3, angle);
}

int strengthToAngle(int strength) {
  if (strength < 0)
    strength = 0;
  if (strength > 100)
    strength = 100;
  // 270度(開) → 90度(最大閉) の範囲に制限
  return map(strength, 0, 100, 270, 90);
}

void attachAllServos() {
  if (!servo1.attached())
    servo1.attach(PIN_SERVO1, US_AT_0_DEG, US_AT_270_DEG);
  if (!servo2.attached())
    servo2.attach(PIN_SERVO2, US_AT_0_DEG, US_AT_270_DEG);
  if (!servo3.attached())
    servo3.attach(PIN_SERVO3, US_AT_0_DEG, US_AT_270_DEG);
}

void detachAllServos() {
  if (servo1.attached())
    servo1.detach();
  if (servo2.attached())
    servo2.detach();
  if (servo3.attached())
    servo3.detach();
}

// 安全なサーボ制御関数 (制限とオフセット適用)
void setServoAngleSafe(int servoNum, int targetAngle) {
  int minA = 0;
  int maxA = 270;
  int offset = 0;

