sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
  if (servoNum == 1) {
    minA = minAngle1;
    maxA = maxAngle1;
    offset = servo1Offset;
  } else if (servoNum == 2) {
    minA = minAngle2;
    maxA = maxAngle2;
    offset = servo2Offset;
  } else if (servoNum == 3) {
    minA = minAngle3;
    maxA = maxAngle3;
    offset = servo3Offset;
  } else {
    return; // Invalid servo number
  }

  // 1. 角度制限 (最優先)
  if (targetAngle < minA)
    targetAngle = minA;
  if (targetAngle > maxA)
    targetAngle = maxA;

  // 2. オフセット適用
  // 補正: 目標角度 - オフセット
  int correctedAngle = targetAngle - offset;

  // 3. 物理限界リミット
  if (correctedAngle < 0)
    correctedAngle = 0;
  if (correctedAngle > 270)
    correctedAngle = 270;

  // 4. 出力
  int us = map(correctedAngle, 0, 270, US_AT_0_DEG, US_AT_270_DEG);

  if (servoNum == 1) {
    if (!servo1.attached())
      servo1.attach(PIN_SERVO1, US_AT_0_DEG, US_AT_270_DEG);
    servo1.writeMicroseconds(us);
  } else if (servoNum == 2) {
    if (!servo2.attached())
      servo2.attach(PIN_SERVO2, US_AT_0_DEG, US_AT_270_DEG);
    servo2.writeMicroseconds(us);
  } else if (servoNum == 3) {
    if (!servo3.attached())
      servo3.attach(PIN_SERVO3, US_AT_0_DEG, US_AT_270_DEG);
    servo3.writeMicroseconds(us);
  }
}

float measureDistance() {
  digitalWrite(TRIG_PIN, LOW);
  delayMicroseconds(2);
  digitalWrite(TRIG_PIN, HIGH);
  delayMicroseconds(10);
  digitalWrite(TRIG_PIN, LOW);

  long duration = pulseIn(ECHO_PIN, HIGH, 30000);
  float distance = duration * 0.034 / 2.0;
  return distance;
}

// API: Start
void handleApiStart() {
  if (server.hasArg("str"))
    targetStrength = server.arg("str").toInt();
  if (server.hasArg("cnt"))
    targetCount = server.arg("cnt").toInt();
  if (server.hasArg("preset"))
    currentSessionPreset = server.arg("preset");
  else
    currentSessionPreset = "カスタム";

  if (targetStrength > 100)
    targetStrength = 100;
  if (targetStrength < 0)
    targetStrength = 0;

  Serial.printf("[API] Start: Str=%d%%, Cnt=%d, Preset=%s\n", targetStrength,
                targetCount, currentSessionPreset.c_str());

  currentCycle = 0;
  sessionStartTime = millis();
  currentState = PREPARE_SQUEEZE;

  server.send(200, "text/plain", "OK");
}

void handleApiStop() {
  Serial.println("[API] Stop");
  currentState = IDLE;
  attachAllServos();
  setAllServosAngle(270);
  server.send(200, "text/plain", "OK");
}

void handleApiSettings() {
  if (server.hasArg("hold")) {
    holdTimeSec = server.arg("hold").toFloat();
    preferences.putFloat("hold", holdTimeSec);
  }
  if (server.hasArg("reach")) {
    reachTimeSec = server.arg("reach").toFloat();
    preferences.putFloat("reach", reachTimeSec);
  }
  // Sync params for sensor auto-start
  if (server.hasArg("str"))
    targetStrength = server.arg("str").toInt();
  if (server.hasArg("cnt"))
    targetCount = server.arg("cnt").toInt();

  String json = "{";
  json += "\"hold\":" + String(holdTimeSec) + ",";
  json += "\"reach\":" + String(reachTimeSec) + ",";
  json += "\"pin13\":" + String(pin13State) + ",";
  json += "\"sensor\":" + String(sensorEnabled);
  json += "}";
  server.send(200, "application/json", json);
}

void handleApiPin13() {
  if (server.hasArg("val")) {
    pin13State = server.arg("val").toInt();
    digitalWrite(13, pin13State ? HIGH : LOW);
    preferences.putInt("pin13", pin13State);
  }
  server.send(200, "text/plain", "OK");
}

void handleApiStatus() {
  String s;
  switch (currentState) {
  case IDLE:
    s = "IDLE";
    break;
  case PREPARE_SQUEEZE:
    s = "PREPARE_SQUEEZE";
    break;
  case SQUEEZING:
    s = "SQUEEZING";
    break;
  case HOLDING:
    s = "HOLDING";
    break;
  case RELEASING:
    s = "RELEASING";
    break;
  case WAIT_CYCLE:
    s = "WAIT_CYCLE";
    break;
  }

  float cycleDur = reachTimeSec + holdTimeSec + 0.3;
  float totalDur = targetCount * cycleDur;

  String json = "{";
  json += "\"state\":\"" + s + "\",";
  json += "\"cycle\":" + String(currentCycle) + ",";
  json += "\"total\":" + String(targetCount) + ",";
  json += "\"elap\":" + String(millis() - sessionStartTime) + ",";
  json += "\"pin13\":" + String(pin13State) + ",";
  json += "\"dur\":" + String(totalDur);
  json += "}";
  server.send(200, "application/json", json);
}

void handleApiManual() {
  if (server.hasArg("val")) {
    int pct = server.arg("val").toInt();
    if (pct < 0)
      pct = 0;
    if (pct > 100)
      pct = 100;

    int targetAngle = strengthToAngle(pct);

    currentState = IDLE;
    stateStartTime =
        millis(); // Reset idle timer so it doesn't detach immediately
    attachAllServos();
    setAllServosAngle(targetAngle);

    Serial.printf("[API] Manual: %d%% -> %d deg\n", pct, targetAngle);
  }
  server.send(200, "text/plain", "OK");
}

void handleApiManualAngle() {
  if (server.hasArg("angle")) {
    int angle = server.arg("angle").toInt();
    // 90度～270度の範囲に制限
    if (angle < 90)
      angle = 90;
    if (angle > 270)
      angle = 270;

    currentState = IDLE;
    stateStartTime = millis();
    attachAllServos();
    setAllServosAngle(angle);

    Serial.printf("[API] Manual Angle: %d degrees\n", angle);
  }
  server.send(200, "text/plain", "OK");
}

void handleApiServoAll() {
  if (server.hasArg("angle")) {
    int angle = server.arg("angle").toInt();
    if (angle < 90)
      angle = 90;
    if (angle > 270)
      angle = 270;

    currentState = IDLE;
    stateStartTime = millis();
    attachAllServos();
    setAllServosAngle(angle);

    Serial.printf("[API] All Servos: %d degrees\n", angle);
  }
  server.send(200, "text/plain", "OK");
}

void handleApiServoIndividual() {
  if (server.hasArg("servo") && server.hasArg("angle")) {
    int servoNum = server.arg("servo").toInt();
    int angle = server.arg("angle").toInt();
    // 範囲チェックは setServoAngleSafe
    // 内で行われるため簡易チェックのみ、または省略可だが一応残す if (angle <
    // 90) angle = 90; //
    // 制限は個別のmin/maxに委ねるべきか？安全のためsetServoAngleSafeにお任せする

    currentState = IDLE;
    stateStartTime = millis();

    setServoAngleSafe(servoNum, angle);

    Serial.printf("[API] Servo %d: %d degrees\n", servoNum, angle);
  }
  server.send(200, "text/plain", "OK");
}

void handleApiHistory() {
  String json = "[";
  for (size_t i = 0; i < historyLog.size(); i++) {
    if (i > 0)
      json += ",";
    json += "{";
    json += "\"time\":\"" + historyLog[i].timeStr + "\",";
    json += "\"preset\":\"" + historyLog[i].preset + "\",";
    json += "\"strength\":" + String(historyLog[i].strength) + ",";
    json += "\"count\":" + String(historyLog[i].count);
    json += "}";
  }
  json += "]";
  server.send(200, "application/json", json);
}

