sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
void handleApiServoOffset() {
  if (server.hasArg("servo") && server.hasArg("value")) {
    int servoNum = server.arg("servo").toInt();
    int value = server.arg("value").toInt();
    if (value >= -90 && value <= 90 && servoNum >= 1 && servoNum <= 3) {
      int correctedAngle = 270 - value;
      if (correctedAngle < 0)
        correctedAngle = 0;
      if (correctedAngle > 270)
        correctedAngle = 270;
      int us = map(correctedAngle, 0, 270, US_AT_0_DEG, US_AT_270_DEG);

      if (servoNum == 1) {
        servo1Offset = value;
        preferences.putInt("servo1Off", value);
        if (!servo1.attached())
          servo1.attach(PIN_SERVO1, US_AT_0_DEG, US_AT_270_DEG);
        servo1.writeMicroseconds(us);
      } else if (servoNum == 2) {
        servo2Offset = value;
        preferences.putInt("servo2Off", value);
        if (!servo2.attached())
          servo2.attach(PIN_SERVO2, US_AT_0_DEG, US_AT_270_DEG);
        servo2.writeMicroseconds(us);
      } else if (servoNum == 3) {
        servo3Offset = value;
        preferences.putInt("servo3Off", value);
        if (!servo3.attached())
          servo3.attach(PIN_SERVO3, US_AT_0_DEG, US_AT_270_DEG);
        servo3.writeMicroseconds(us);
      }
      Serial.printf("[API] Servo %d Offset: %d\n", servoNum, value);
      server.send(200, "text/plain", "OK");
    } else {
      server.send(400, "text/plain", "Error: servo 1-3, value -90~+90");
    }
  } else if (server.hasArg("servo")) {
    int servoNum = server.arg("servo").toInt();
    int offset = 0;
    if (servoNum == 1)
      offset = servo1Offset;
    else if (servoNum == 2)
      offset = servo2Offset;
    else if (servoNum == 3)
      offset = servo3Offset;
    String json = "{\"offset\":" + String(offset) + "}";
    server.send(200, "application/json", json);
  } else {
    server.send(400, "text/plain", "Missing servo parameter");
  }
}

void handleApiServoLimit() {
  if (server.hasArg("servo")) {
    int servoNum = server.arg("servo").toInt();
    if (server.hasArg("min") && server.hasArg("max")) {
      int minV = server.arg("min").toInt();
      int maxV = server.arg("max").toInt();
      if (minV < 0)
        minV = 0;
      if (maxV > 270)
        maxV = 270;

      if (servoNum == 1) {
        minAngle1 = minV;
        maxAngle1 = maxV;
        preferences.putInt("minAng1", minV);
        preferences.putInt("maxAng1", maxV);
      } else if (servoNum == 2) {
        minAngle2 = minV;
        maxAngle2 = maxV;
        preferences.putInt("minAng2", minV);
        preferences.putInt("maxAng2", maxV);
      } else if (servoNum == 3) {
        minAngle3 = minV;
        maxAngle3 = maxV;
        preferences.putInt("minAng3", minV);
        preferences.putInt("maxAng3", maxV);
      }
      server.send(200, "text/plain", "OK");
    } else {
      int minV = 0, maxV = 270;
      if (servoNum == 1) {
        minV = minAngle1;
        maxV = maxAngle1;
      } else if (servoNum == 2) {
        minV = minAngle2;
        maxV = maxAngle2;
      } else if (servoNum == 3) {
        minV = minAngle3;
        maxV = maxAngle3;
      }

      String json =
          "{\"min\":" + String(minV) + ",\"max\":" + String(maxV) + "}";
      server.send(200, "application/json", json);
    }
  } else {
    server.send(400, "text/plain", "Missing servo param");
  }
}

void handleApiSensorMode() {
  if (server.hasArg("val")) {
    sensorEnabled = (server.arg("val").toInt() == 1);
    preferences.putBool("sensor", sensorEnabled);
    Serial.printf("[API] Sensor Mode: %s\n", sensorEnabled ? "ON" : "OFF");
  }
  server.send(200, "text/plain", "OK");
}

void handleApiDistance() {
  String json = "{\"distance\":" + String(currentDistance, 1) + "}";
  server.send(200, "application/json", json);
}

void handleRoot() {
  String html = html_main;
  html.replace("{{BUILD_TIME}}", __DATE__ " " __TIME__);
  server.send(200, "text/html", html);
}

void setup() {
  Serial.begin(115200);

  preferences.begin("job", false);
  holdTimeSec = preferences.getFloat("hold", 0.5);
  reachTimeSec = preferences.getFloat("reach", 0.5);
  pin13State = preferences.getInt("pin13", 0);
  servo1Offset = preferences.getInt("servo1Off", 0);
  servo2Offset = preferences.getInt("servo2Off", 0);
  servo3Offset = preferences.getInt("servo3Off", 0);

  sensorEnabled = preferences.getBool("sensor", false);

  minAngle1 = preferences.getInt("minAng1", 0);
  maxAngle1 = preferences.getInt("maxAng1", 270);
  minAngle2 = preferences.getInt("minAng2", 0);
  maxAngle2 = preferences.getInt("maxAng2", 270);
  minAngle3 = preferences.getInt("minAng3", 0);
  maxAngle3 = preferences.getInt("maxAng3", 270);

  // HC-SR04センサー設定
  pinMode(32, OUTPUT); // Trig
  pinMode(33, INPUT);  // Echo

  pinMode(13, OUTPUT);

  digitalWrite(13, pin13State ? HIGH : LOW);

  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);

  servo1.setPeriodHertz(50);
  servo2.setPeriodHertz(50);
  servo3.setPeriodHertz(50);

  attachAllServos();
  setAllServosAngle(270); // 初期位置

  // --- AP Mode Setup (Yakisoba-Shiro) ---
  WiFi.disconnect(true);
  delay(100);
  WiFi.mode(WIFI_AP);
  WiFi.softAP("焼きそば四郎"); // No Password

  Serial.print("AP IPs: ");
  Serial.println(WiFi.softAPIP());

  // DNS Server (Captive Portal)
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());

  server.on("/", handleRoot);
  server.on("/api/status", handleApiStatus);
  server.on("/api/start", handleApiStart);
  server.on("/api/stop", handleApiStop);
  server.on("/api/settings", handleApiSettings);
  server.on("/api/pin13", handleApiPin13);
  server.on("/api/manual", handleApiManual);
  server.on("/api/manual_angle", handleApiManualAngle);
  server.on("/api/servo_all", handleApiServoAll);
  server.on("/api/servo_individual", handleApiServoIndividual);
  server.on("/api/history", handleApiHistory);
  server.on("/api/servo_offset", handleApiServoOffset);
  server.on("/api/servo_limit", handleApiServoLimit);
  server.on("/api/sensor_mode", handleApiSensorMode);
  server.on("/api/distance", handleApiDistance);

  // Captive Portal Redirect
  server.onNotFound([]() { handleRoot(); });

  server.begin();
  Serial.println("Ready.");
}

void loop() {
  dnsServer.processNextRequest();
  server.handleClient();

  unsigned long now = millis();

