sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
  // HC-SR04センサー測定 (1秒ごと)
  if (now - lastDistanceMeasure > 1000) {
    currentDistance = measureDistance();
    lastDistanceMeasure = now;

    // Sensor Trigger
    if (sensorEnabled && currentState == IDLE && currentDistance < 10.0 &&
        currentDistance > 0.1) {
      Serial.printf("Sensor Trigger: %.1f cm -> START\n", currentDistance);
      currentCycle = 0;
      sessionStartTime = millis();
      currentState = PREPARE_SQUEEZE;
    }
  }

  if (currentState != lastState) {
    stateStartTime = now;
    Serial.printf("State: %d\n", currentState);

    if (currentState == PREPARE_SQUEEZE) {
      attachAllServos();
      setAllServosAngle(270);
    }
    lastState = currentState;
  }

  switch (currentState) {
  case IDLE:
    // Auto Detach Removed as per user request
    yield(); // Watchdog reset
    break;

  case PREPARE_SQUEEZE:
    setAllServosAngle(270);
    if (now - stateStartTime > 300) {
      currentState = SQUEEZING;
    }
    yield(); // Watchdog reset
    break;

  case SQUEEZING: {
    unsigned long duration = reachTimeSec * 1000;
    unsigned long elapsed = now - stateStartTime;
    int startAngle = 270;
    int targetAngle = strengthToAngle(targetStrength);

    if (elapsed >= duration) {
      setAllServosAngle(targetAngle);
      currentState = HOLDING;
    } else {
      float progress = (float)elapsed / (float)duration;
      int currentAngle = startAngle + (targetAngle - startAngle) * progress;
      setAllServosAngle(currentAngle);
    }
    yield(); // Watchdog reset
  } break;

  case HOLDING:
    if (now - stateStartTime >= (holdTimeSec * 1000)) {
      currentState = RELEASING;
    }
    yield(); // Watchdog reset
    break;

  case RELEASING:
    setAllServosAngle(270);
    if (now - stateStartTime >= 300) {
      currentState = WAIT_CYCLE;
    }
    yield(); // Watchdog reset
    break;

  case WAIT_CYCLE:
    currentCycle++;
    if (currentCycle < targetCount) {
      currentState = SQUEEZING;
    } else {
      Serial.println("Finished.");
      setAllServosAngle(270);
      currentState = IDLE;

      // --- 履歴保存 ---
      struct tm timeinfo;
      if (!getLocalTime(&timeinfo)) {
        Serial.println("Failed to obtain time");
      } else {
        char timeStringBuff[50];
        strftime(timeStringBuff, sizeof(timeStringBuff), "%Y/%m/%d %H:%M",
                 &timeinfo);

        HistoryItem newItem;
        newItem.timeStr = String(timeStringBuff);
        newItem.preset = currentSessionPreset;
        newItem.strength = targetStrength;
        newItem.count = targetCount;

        historyLog.push_back(newItem);

        // 最大保存件数 (20件)
        if (historyLog.size() > 20) {
          historyLog.erase(historyLog.begin());
        }
      }
      // ----------------
    }
    yield(); // Watchdog reset
    break;
  }
}
